marcusjhang/cloudagotchi/firmware/sdkconfig.defaults
# Board + app configuration baked into the build so `idf.py build` just works.
# Each line has a reason; see PLAN.md §5 (hardware landmines).

CONFIG_IDF_TARGET="esp32s3"

# 16 MB QIO flash, custom table with a 12 MB app partition (sprites are
# compiled in as C arrays and live in .rodata).
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# 8 MB octal PSRAM. LVGL draw buffers live there. Stays at 40 MHz on purpose:
# cloudagotchi saw display corruption at 80 MHz on this board.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_40M=y

# 240 MHz (default is 160), -O2, 1 kHz tick for responsive LVGL timers.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000

# The 3.5 KB default main stack overflows on the first big local array.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# LVGL fonts used by the UI (14 is on by default).
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_24=y
